{
    "status": "ok",
    "totalResults": 11285,
    "articles": [
        
        {
            "source": {
                "id": null,
                "name": "Slashdot.org"
            },
            "author": "BeauHD",
            "title": "Binance's CZ Slams Reports Binance's Reserves Are Full of Its Own Tokens",
            "description": "An anonymous reader quotes a report from Benzinga: Binance CEO Changpeng Zhao on Friday came down heavily on a report the cryptocurrency exchange holds $74.6 billion in tokens, out of which nearly 40% are its own stablecoin BUSD and native coin BNB. Sharing d…",
            "url": "https://slashdot.org/story/22/11/11/2122223/binances-cz-slams-reports-binances-reserves-are-full-of-its-own-tokens",
            "urlToImage": "https://a.fsdn.com/sd/topics/bitcoin_64.png",
            "publishedAt": "2022-11-12T00:02:00Z",
            "content": "CZ was at a conference in Indonesia where he said the industry must look to regulation [cnn.com] and acknowledged it is currently facing a 2008 scenario. “We’ve just seen another very big player goin… [+1177 chars]"
        },
        {
            "source": {
                "id": "business-insider",
                "name": "Business Insider"
            },
            "author": "tmohamed@businessinsider.com (Theron Mohamed)",
            "title": "Billionaire investor Leon Cooperman says the S&P 500 won't hit a new high for a long time - and predicts a US recession and stubborn inflation",
            "description": "The S&P 500 won't return to its peak of 4,800 points for a while, and will generate mediocre returns until at least 2030, Cooperman said.",
            "url": "https://markets.businessinsider.com/news/stocks/leon-cooperman-stock-market-outlook-economy-inflation-recession-crypto-ftx-2022-12",
            "urlToImage": "https://i.insider.com/5ea1acdf5bd7a56260519524?width=1200&format=jpeg",
            "publishedAt": "2022-12-01T13:02:48Z",
            "content": "US stocks will suffer a hangover for years, and the US economy will endure stubborn inflation and slump into recession, Leon Cooperman has warned. He also trashed cryptocurrencies following the recen… [+3081 chars]"
        },
        {
            "source": {
                "id": "business-insider",
                "name": "Business Insider"
            },
            "author": "bnguyen@insider.com (Britney Nguyen)",
            "title": "Sam Bankman-Fried was once caught playing the video game 'League of Legends' during a pitch meeting for FTX",
            "description": "Sam Bankman-Fried, founder of cryptocurrency platform FTX that's on the brink of bankruptcy, played 'League of Legends' during a meeting with Sequoia.",
            "url": "https://www.businessinsider.com/ftx-sam-bankman-fried-league-of-legends-investor-pitch-meeting-2022-11",
            "urlToImage": "https://i.insider.com/636d27a5951bdc00182d8253?width=1200&format=jpeg",
            "publishedAt": "2022-11-10T18:33:14Z",
            "content": "Sam Bankman-Fried was once caught playing \"League of Legends,\" during a meeting with investors from Sequoia Capital, according to a since-removed profile of the founder on the firm's website.\r\nBankma… [+3049 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Dot Esports"
            },
            "author": "George Geddes",
            "title": "Not going to plan: Twitter's new policies have publicly trapped TSM in its FTX partnership - Dot Esports",
            "description": "<ol><li>Not going to plan: Twitter's new policies have publicly trapped TSM in its FTX partnership  Dot Esports\r\n</li><li>Bitcoin prices sink as FTX contagion spreads and Genesis halts withdrawals: CNBC Crypto World  CNBC Television\r\n</li><li>Gaming Pros Batt…",
            "url": "https://dotesports.com/business/news/twitters-new-policies-publicly-trapped-tsm-in-ftx-partnership/",
            "urlToImage": "https://cdn1.dotesports.com/wp-content/uploads/2022/11/11124406/TSMFTX-Hotel-TSM-768x510.jpg",
            "publishedAt": "2022-11-16T16:05:07Z",
            "content": "North American esports organization TSM is unable to change its social media profile to remove FTX from its Twitter name following its ceased partnership with the crypto exchange earlier today. \r\nAt … [+2004 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Ctvnews.ca"
            },
            "author": null,
            "title": "Ontario man arrested in U.S. for alleged ransomware crimes - CTV News",
            "description": "<ol><li>Ontario man arrested in U.S. for alleged ransomware crimes  CTV News\r\n</li><li>Bradford, Ont. man charged in connection with alleged role in the LockBit global ransomware scheme  CP24\r\n</li><li>U.S. authorities charge Russian-Canadian over alleged tie…",
            "url": "https://www.ctvnews.ca/canada/russian-canadian-man-arrested-awaiting-u-s-extradition-for-alleged-global-ransomware-crimes-1.6148082",
            "urlToImage": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2021/7/8/person-s-hands-on-a-laptop-1-5501815-1668114053983.jpg",
            "publishedAt": "2022-11-10T20:53:00Z",
            "content": "A Russian-Canadian man from Ontario is in police custody and awaiting extradition to the United States for his alleged participation in a global ransomware campaign, the U.S. Department of Justice an… [+3762 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Slashdot.org"
            },
            "author": "BeauHD",
            "title": "Crypto.com Preliminary Audit Shows 20% of Its Assets Are In Shiba Inu Coin",
            "description": "An anonymous reader quotes a report from CoinDesk: The swift collapse of the FTX crypto exchange has sparked an industry push among big rivals to publish proof of their reserves as a means to provide transparency into the assets on their platforms. With those…",
            "url": "https://slashdot.org/story/22/11/11/2247234/cryptocom-preliminary-audit-shows-20-of-its-assets-are-in-shiba-inu-coin",
            "urlToImage": "https://a.fsdn.com/sd/topics/bitcoin_64.png",
            "publishedAt": "2022-11-12T13:00:00Z",
            "content": "An anonymous reader quotes a report from CoinDesk: The swift collapse of the FTX crypto exchange has sparked an industry push among big rivals to publish proof of their reserves as a means to provide… [+1836 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Slashdot.org"
            },
            "author": "BeauHD",
            "title": "New CryWiper Data Wiper Targets Russian Courts, Mayor's Offices",
            "description": "An anonymous reader quotes a report from BleepingComputer: A previously undocumented data wiper named CryWiper is masquerading as ransomware, but in reality, destroys data beyond recovery in attacks against Russian mayor's offices and courts. CryWiper was fir…",
            "url": "https://it.slashdot.org/story/22/12/03/0044234/new-crywiper-data-wiper-targets-russian-courts-mayors-offices",
            "urlToImage": "https://a.fsdn.com/sd/topics/security_64.png",
            "publishedAt": "2022-12-03T13:00:00Z",
            "content": "A previously undocumented data wiper named CryWiper is masquerading as ransomware, but in reality, destroys data beyond recovery in attacks against Russian mayor's offices and courts. CryWiper was fi… [+1655 chars]"
        },
        {
            "source": {
                "id": "business-insider",
                "name": "Business Insider"
            },
            "author": "mfox@businessinsider.com (Matthew Fox)",
            "title": "US stocks trade mixed as investors digest Target earnings and retail sales data",
            "description": "Despite Target's weak earnings, \"the October retail sales report underscores that a more discerning US consumer continues to spend,\" LPL said.",
            "url": "https://markets.businessinsider.com/news/stocks/stock-market-news-today-investors-digest-retail-sales-target-earnings-2022-11",
            "urlToImage": "https://i.insider.com/6374eecb807d55001800d287?width=1200&format=jpeg",
            "publishedAt": "2022-11-16T14:37:54Z",
            "content": "US stocks were mixed on Wednesday as investors turned their attention to retail sales data and the outlook from Target following its third-quarter earnings.\r\nRetail sales jumped 1.3% in October to $6… [+1427 chars]"
        }
    ]
}